app/controllers/client_workouts_controller.rb

SELECT "client_workouts".* FROM "client_workouts"
---
  def index
    @client_workouts = ClientWorkout.all

INSERT INTO "client_workouts" ("client_name", "created_at", "date_of_workout", "duration_mins", "paid_amount", "trainer", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @client_workout = ClientWorkout.new(client_workout_params)

    respond_to do |format|
      if @client_workout.save

SELECT "client_workouts".* FROM "client_workouts" WHERE (client_name = 'clint' OR trainer = 'clint')
---
  def find
    @client_workouts = ClientWorkout.find(:all,:conditions=>["client_name = ? OR trainer = ?",params[:search_string],params[:search_string]])

SELECT "client_workouts".* FROM "client_workouts" WHERE "client_workouts"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_client_workout
      @client_workout = ClientWorkout.find(params[:id])